[
  {
    "title": "X Kills in a Game",
    "desc": "Get a specific number of kills (e.g., 10, 15, 20). Adjust based on your skill level."
  },
  {
    "title": "One-Gun Kill",
    "desc": "Get all your kills using only one type of weapon (e.g., pistols, snipers, or shotguns)."
  },
  {
    "title": "No Reload",
    "desc": "You're not allowed to reload during combat. Must switch to another weapon or melee."
  },
  {
    "title": "Revenge Hunter",
    "desc": "Hunt down and eliminate the player who killed you if you return via the Gulag."
  },
  {
    "title": "Execution-Only",
    "desc": "Get at least one execution/finishing move in the game."
  },
  {
    "title": "Headshot Only",
    "desc": "Every kill must be a headshot. Any non-headshot kill doesn't count."
  },
  {
    "title": "Random Loadout",
    "desc": "Use a randomized loadout generated by viewers or a Warzone loadout generator tool."
  },
  {
    "title": "Ground Loot Only",
    "desc": "You can only use weapons and gear found on the ground - no loadout drops."
  },
  {
    "title": "No Attachments",
    "desc": "Use guns without any attachments."
  },
  {
    "title": "Throwables Only",
    "desc": "All kills must be with grenades, Molotovs, throwing knives, or C4."
  },
  {
    "title": "Melee Only",
    "desc": "Get all your kills with melee weapons or bare fists."
  },
  {
    "title": "No Buy Station",
    "desc": "Survive without using a buy station (no UAVs, loadout purchases, or revives)."
  },
  {
    "title": "Pacifist",
    "desc": "Try to survive as long as possible without killing anyone."
  },
  {
    "title": "Circle Hugger",
    "desc": "Stick to the edge of the safe zone the entire game and avoid the center."
  },
  {
    "title": "Gulag-Free Run",
    "desc": "If you die, you must quit the match - no Gulag allowed."
  },
  {
    "title": "Sniper's Nest",
    "desc": "Stay on rooftops or high ground for the entire game."
  },
  {
    "title": "No Armor Plates",
    "desc": "Play the game without equipping any armor plates."
  },
  {
    "title": "No Sprinting",
    "desc": "You're not allowed to sprint during the game."
  },
  {
    "title": "Chat-Selected Drop",
    "desc": "Let the chat choose where you drop."
  },
  {
    "title": "Chat-Driven Contracts",
    "desc": "Let viewers decide which contract you pick next (bounty, scavenger, etc.)."
  },
  {
    "title": "Kill Count Prediction",
    "desc": "Viewers guess how many kills you'll get, and you try to beat their predictions."
  },
  {
    "title": "No Map",
    "desc": "Play without looking at the map or minimap."
  }
]
